---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PresetInitialColor Constructor
PresetInitialColor Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | PresetInitialColor(ColorPreset) | Creates an initial color preset object with the given preset value. |
|  | PresetInitialColor(PresetInitialColor) | Creates a copy of the given preset initial color |

# See Also

PresetInitialColor Class

PresetInitialColor Members

Autodesk.Revit.DB.Lighting Namespace